app/controllers/application_controller.rb

	def authenticate_request
		begin


		header = request.headers["Authorization"]
		header = header.split(" ").last if header
		decoded = jwt_decode(header)

		@current_user=User.find(decoded[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]