app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses" WHERE "courses"."status" = ? AND (title LIKE '%a%')  [["status", "active"]]
SELECT 1 AS one FROM "courses" WHERE "courses"."title" = ? LIMIT ?  [["title", "hello ji"], ["LIMIT", 1]]
SELECT "courses".* FROM "courses" WHERE "courses"."status" = ? AND "courses"."category_id" = ? AND (title LIKE '%hello%')  [["status", "active"], ["category_id", 3]]
---
  def index
    if @current_user.type == "Instructor"
      courses = @current_user.courses
      courses = courses.where(status: params[:status]) if params[:status].present?
      courses = courses.where("title LIKE ?", "%#{params[:title]}%") if params[:title].present?
    else
      courses = Course.where(status: "active")
      courses = courses.where(category_id: params[:category_id]) if params[:category_id].present?