app/controllers/courses_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "courses" ("title", "about", "status", "course_content", "instructor_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
      user = User.find(@current_user.id)
      if user.type == "Instructor"
        course = @current_user.courses.new(course_params)

        if course.save

SELECT "courses".* FROM "courses" WHERE "courses"."instructor_id" = ?  [["instructor_id", 2]]
SELECT "courses".* FROM "courses" WHERE "courses"."instructor_id" = ?  [["instructor_id", 1]]
SELECT 1 AS one FROM "courses" WHERE "courses"."instructor_id" = ? LIMIT ?  [["instructor_id", 7], ["LIMIT", 1]]
---
    def index
      @all_courses = Course.where(instructor_id: @current_user.id)

      if @all_courses.empty?

SELECT "courses".* FROM "courses" WHERE "courses"."instructor_id" = ? AND "courses"."id" = ? LIMIT ?  [["instructor_id", 1], ["id", nil], ["LIMIT", 1]]
---
    def show
      @single_course = Course.find_by(instructor_id: @current_user.id, id: params[:id])

SELECT "courses".* FROM "courses" WHERE "courses"."instructor_id" = ? AND "courses"."id" = ? LIMIT ?  [["instructor_id", 2], ["id", 1], ["LIMIT", 1]]
SELECT "courses".* FROM "courses" WHERE (1)
SELECT 1 AS one FROM "courses" WHERE "courses"."instructor_id" = ? AND (title LIKE '%sahsb%') LIMIT ?  [["instructor_id", 11], ["LIMIT", 1]]
---
    def single_course_with_name
      all_courses = Course.where(instructor_id: @current_user).where("title LIKE ?", "%#{params[:title]}%")

      if all_courses.empty?

SELECT "courses".* FROM "courses" WHERE "courses"."instructor_id" = ? AND "courses"."status" = ?  [["instructor_id", 6], ["status", "active"]]
SELECT "courses".* FROM "courses" WHERE (title LIKE'%c%')
SELECT 1 AS one FROM "courses" WHERE "courses"."instructor_id" = ? AND "courses"."status" = ? LIMIT ?  [["instructor_id", 11], ["status", "active"], ["LIMIT", 1]]
---
    def course_status
      all_courses = Course.where(instructor_id: @current_user.id, status: params[:status])

      if all_courses.empty?

SELECT "courses".* FROM "courses" WHERE "courses"."status" = ?  [["status", "active"]]
SELECT 1 AS one FROM "courses" WHERE "courses"."status" = ? LIMIT ?  [["status", "active"], ["LIMIT", 1]]
---
def allcourses
  all_courses = Course.where(status: "active")

  if all_courses.empty?

SELECT "courses".* FROM "courses" WHERE "courses"."category_id" = ? AND "courses"."status" = ?  [["category_id", 1], ["status", "active"]]
SELECT 1 AS one FROM "courses" WHERE "courses"."category_id" = ? AND "courses"."status" = ? LIMIT ?  [["category_id", 1], ["status", "active"], ["LIMIT", 1]]
---
def course_category
  all_courses = Course.where(category_id: params[:category_id], status: "active")

  if all_courses.empty?

SELECT "courses".* FROM "courses" WHERE (title LIKE '%we%') AND "courses"."category_id" = ? LIMIT ?  [["category_id", 12], ["LIMIT", 1]]
SELECT "courses".* FROM "courses" WHERE (title LIKE '%h%') AND "courses"."category_id" = ? AND "courses"."status" = ?  [["category_id", 3], ["status", "active"]]
SELECT 1 AS one FROM "courses" WHERE "courses"."category_id" = ? AND (title LIKE '%5%') LIMIT ?  [["category_id", nil], ["LIMIT", 1]]
---
def name_and_category
  all_courses = Course.where("title LIKE ?", "%#{params[:title]}%").where(category_id: params[:category_id],status: "active")

  if all_courses.empty?

SELECT "courses".* FROM "courses" WHERE (title LIKE'%web%') AND "courses"."status" = ? LIMIT ?  [["status", "active"], ["LIMIT", 1]]
SELECT "courses".* FROM "courses" WHERE (title LIKE '%h%') AND "courses"."status" = ?  [["status", "active"]]
SELECT 1 AS one FROM "courses" WHERE (title LIKE '%h%') LIMIT ?  [["LIMIT", 1]]
---
def course_with_name
  all_courses = Course.where("title LIKE ?", "%#{params[:title]}%").where(status: "active")

  if all_courses.empty?