app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses" WHERE "courses"."instructor_id" = ? AND "courses"."status" = ?  [["instructor_id", 2], ["status", "active"]]
---
  def course_status
    all_courses = Course.where(instructor_id: @current_user.id, status: params[:status])
    authorize Course
    if all_courses.empty?