app/controllers/enrollments_controller.rb

SELECT 1 AS one FROM "enrollments" WHERE "enrollments"."course_id" = ? AND "enrollments"."student_id" = ? LIMIT ?  [["course_id", 3], ["student_id", 12], ["LIMIT", 1]]
---
  def index
    all_courses = Enrollment.where(student_id: @current_user.id)
    authorize Enrollment
    if all_courses.empty?

SELECT "courses"."id" FROM "courses" WHERE (title LIKE '%%')
SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."course_id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) AND "enrollments"."student_id" = ?
---
  def search_in_my_course
    course = Course.where("title LIKE ?", "%#{params[:title]}%").pluck(:id)
    authorize Enrollment

    all_courses = Enrollment.where(course_id: course, student_id: @current_user.id)