app/controllers/enrollments_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "enrollments" ("course_id", "student_id", "created_at", "updated_at", "cou_status") VALUES (?, ?, ?, ?, ?)  [["course_id", 1], ["student_id", 1], ["created_at", "2023-07-10 13:48:48.115611"], ["updated_at", "2023-07-10 13:48:48.115611"], ["cou_status", "pending"]]
---
    def create
      user = User.find(@current_user.id)
      if user.type == "Student"
        @enroll = @current_user.enrollments.new(enroll_params)
        if @enroll.save

SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."student_id" = ?  [["student_id", 12]]
SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."student_id" = ?  [["student_id", 1]]
SELECT 1 AS one FROM "enrollments" WHERE "enrollments"."student_id" = ? LIMIT ?  [["student_id", 1], ["LIMIT", 1]]
SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
---
    def index
      all_courses = Enrollment.where(student_id: @current_user.id)

      if all_courses.empty?
        render json: { message: "At this moment, no course is enrolled by you" }, status: :ok
      else
        courses_data = all_courses.map do |enrollment|

SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "enrollments" SET "updated_at" = ?, "cou_status" = ? WHERE "enrollments"."id" = ?  [["updated_at", "2023-07-11 05:41:54.768768"], ["cou_status", "completed"], ["id", 2]]
---
    def update
      begin
      enrollment = Enrollment.find(params[:id])
      new_status = params[:cou_status]

      if enrollment.update(cou_status: new_status)

SELECT "courses"."id" FROM "courses" WHERE (title LIKE '%hello%')
SELECT "courses".* FROM "courses" WHERE "courses"."student_id" = ? AND (title LIKE'%hello%')  [["student_id", 3]]
SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."student_id" = ?  [["student_id", 12]]
---
    def my_course
      # byebug
      course=Course.where("title LIKE ?", "%#{params[:title]}%").pluck(:id)

      all_courses = Enrollment.where(id:course).find_by(student_id: @current_user.id)