app/controllers/instructors_controller.rb

    def create
      @instructor = Instructor.new(user_params)
      if @instructor.save
---
INSERT INTO "users" ("name", "email", "password_digest", "username", "created_at", "updated_at", "type") VALUES (?, ?, ?, ?, ?, ?, ?)

    def update
      @instructor = Instructor.where(id: @current_user.id).find_by(id:params[:id])
      if !@instructor.blank?
      if @instructor.update(params.permit(:password))
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "[FILTERED]"], ["updated_at", "2023-07-11 06:57:00.638230"], ["id", 2]]

    def destroy
      @instructor = Instructor.where(id: @current_user.id).find_by(id:params[:id])
      if !@instructor.blank?
      if @instructor.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]