app/controllers/students_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "username", "created_at", "updated_at", "type") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
      @student = Student.new(user_params)
      if @student.save