app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "username", "created_at", "updated_at", "type") VALUES (?, ?, ?, ?, ?, ?, ?)